backlog_evidence/review-drain-20260915/check8169-cold-mutations-v2/endpoint-threshold.diff
--- baseline.py
+++ endpoint-threshold.py
@@ -111,7 +111,7 @@
     check('collinear-menu', len(set(four_point_support(q, q))) == 2, 'Original collinear menu control')
     check('chain-endpoint-event', all((abs(dot(q, scale(a * b, q))) == 1 for a, b in product((-1, 1), repeat=2))), 'Every one-record sign path is collinear, including singleton choices')
     axes = tuple((scale(sign, e) for e in (q, qp, (Fraction(0), Fraction(1), Fraction(0))) for sign in (-1, 1)))
-    check('independent-endpoint-analogue', sum((abs(dot(l, r)) < 1 for l, r in product(axes, repeat=2))) == 24, 'Finite six-axis analogue:24/36; Haar probability1 is analytic, not this finite test')
+    check('independent-endpoint-analogue', sum((abs(dot(l, r)) <= 1 for l, r in product(axes, repeat=2))) == 24, 'Finite six-axis analogue:24/36; Haar probability1 is analytic, not this finite test')
     failed = sum((not r['passed'] for r in results))
     passed = len(results) - failed
     print(f'TOTAL: PASS={passed} FAIL={failed}')
