backlog_evidence/review-drain-20260915/check8169-cold-mutations-v2/lambda-inversion.diff
--- baseline.py
+++ lambda-inversion.py
@@ -98,7 +98,7 @@
             vals = [(1 + lam * dot(s, add(q, r))) / 4 for s in four_point_support(q, r)]
             check('linear-bound:' + str((t, lam)), sum(vals) == 1 and min(vals) >= 0, 'Exact valid lambda(t) boundary and interior')
         for alpha in (Fraction(0), Fraction(1, 8), Fraction(1, 2)):
-            lam = (4 * alpha - 1) / (1 + t)
+            lam = (4 * alpha - 1) / (1 - t)
             check('lambda-inverse:' + str((t, alpha)), linear_copy_mass(lam, t) == alpha and abs(lam) * (1 + t) <= 1, 'Function parameterization, not a fixed universal lambda')
         raw = tuple(((1 + dot(s, q)) / 2 for s in four_point_support(q, r)))
         norm = tuple((v / 2 for v in raw))
