backlog_evidence/review-drain-20260915/check8169-cold-mutations-v2/raw-normalization.diff
--- baseline.py
+++ raw-normalization.py
@@ -100,7 +100,7 @@
         for alpha in (Fraction(0), Fraction(1, 8), Fraction(1, 2)):
             lam = (4 * alpha - 1) / (1 + t)
             check('lambda-inverse:' + str((t, alpha)), linear_copy_mass(lam, t) == alpha and abs(lam) * (1 + t) <= 1, 'Function parameterization, not a fixed universal lambda')
-        raw = tuple(((1 + dot(s, q)) / 2 for s in four_point_support(q, r)))
+        raw = tuple(((1 + dot(s, q)) / 3 for s in four_point_support(q, r)))
         norm = tuple((v / 2 for v in raw))
         check('overlap-normalization:' + str(t), sum(raw) == 2 and sum(norm) == 1 and (min(norm) >= 0), 'Raw sum2, normalized ordered-reference law')
     check('excluded-lambda', Fraction(1, 2) - linear_copy_mass(Fraction(1), Fraction(3, 5)) == Fraction(-3, 20), 'lambda=1 at t=3/5 violates nonnegativity')
