backlog_evidence/review-drain-20260915/check8169-cold-mutations-v2/slot-exchange.diff
--- baseline.py
+++ slot-exchange.py
@@ -79,7 +79,7 @@
     check('menu-covariance', all((set(four_point_support(apply_matrix(M, q), apply_matrix(M, qp))) == {apply_matrix(M, s) for s in four_point_support(q, qp)} for M in rotations)), 'All 24 finite group controls; general SO(3) proof is analytic')
     slots = ((Fraction(1), Fraction(0), Fraction(0)), (Fraction(0), Fraction(1), Fraction(0)))
     for label, b in (('adjacent', slots[1]), ('opposite', neg(slots[0]))):
-        check('slot-exchange:' + label, any((apply_matrix(M, slots[0]) == b and apply_matrix(M, b) == slots[0] for M in rotations)), 'Proper cubic slot exchange exists in this occupancy stratum')
+        check('slot-exchange:' + label, any((apply_matrix(M, slots[0]) == b and apply_matrix(M, b) == b for M in rotations)), 'Proper cubic slot exchange exists in this occupancy stratum')
     weights = (Fraction(1, 2), Fraction(1, 4), Fraction(1, 8), Fraction(1, 8))
     law = lambda x, y, w: dict(zip(four_point_support(x, y), w))
     check('ordered-unequal-covariance', all(({apply_matrix(M, s): v for s, v in law(q, qp, weights).items()} == law(apply_matrix(M, q), apply_matrix(M, qp), weights) for M in rotations)), 'Unequal masses retain internal covariance')
