backlog_evidence/review-drain-20260915/drain8172-mutation-capture-binding-v2.diff
--- drain8172-mutation-capture-v1.py
+++ drain8172-mutation-capture-v2.py
@@ -4,7 +4,7 @@
 assert __debug__
 sys.dont_write_bytecode=True
 R=Path('/private/tmp/review-drain-20260915');W=R/'review-meta-slot'
-COLD_REPORT_BINDING = None  # Future immutable revision must bind actual report path, SHA, verdict pointer/value and tree.
+COLD_REPORT_BINDING = {'path': '/private/tmp/review-drain-20260915/drain8172-cold-review-v1.json', 'sha256': 'cd4c748cbf39fc4743d470c4ef912833ab98722f6891598ec33c9d47b6fa3835', 'tree': '12b15627de59706ffa788e1014db4ed435029667', 'verdict_pointer': '/verdict', 'verdict': 'CAPTURE_ELIGIBLE'}  # Future immutable revision must bind actual report path, SHA, verdict pointer/value and tree.
 sha=lambda p:hashlib.sha256(p.read_bytes()).hexdigest()
 ref=lambda p:dict(path=str(p),sha256=sha(p))
 git=lambda *a:subprocess.check_output(['git','-C',str(W),*a],text=True).strip()
