backlog_evidence/review-drain-20260915/drain8173-mutation-capture-binding-v2.diff
--- drain8173-mutation-capture-v1.py
+++ drain8173-mutation-capture-v2.py
@@ -19,7 +19,7 @@
 # Deliberately unbound: a new immutable adapter version must bind the ACTUAL
 # original-reviewer cold report path/hash, exact verdict pointer/value and tree.
 # Early source clearance is insufficient. No hypothetical verdict is accepted.
-COLD_CLEARANCE_BINDING = None
+COLD_CLEARANCE_BINDING = {'path': '/private/tmp/review-drain-20260915/drain8173-cold-review-v1.json', 'sha256': 'bac7fd67ae26ccc43049d4845c0fc3bd80a6007016eb5e4f3c8782f1e80faf4b', 'same_session_provenance': '/root/review_8173 original reviewer continued by root; actual report same_session true', 'verdict_pointer': '/verdict', 'verdict_value': 'CAPTURE_CLEARED', 'tree_pointer': '/source_tree', 'tree': '27b9eec3aa17dad34bfcd5e8d3128214cf8f32e7', 'required_predicates': {'/capture_clearance': True, '/same_session': True, '/reviewer_session': '/root/review_8173', '/base': '51cac1ae0ed3f9d0f399a63a716f8cf351fc5938', '/blockers': []}}
 def confirm_cold(cp,cold,tree):
     b=COLD_CLEARANCE_BINDING
     assert isinstance(b,dict), 'BLOCKED: actual same-session cold report schema/clearance has not yet been bound; root must prepare a new immutable adapter version'
