backlog_evidence/review-drain-20260915/drain8174-mutation-capture-dual-binding-v2.diff
--- drain8174-mutation-capture-v1.py
+++ drain8174-mutation-capture-v2.py
@@ -19,7 +19,7 @@
 # Deliberately unbound: a new immutable adapter version must bind the ACTUAL
 # original-reviewer cold report path/hash, exact verdict pointer/value and tree.
 # Early source clearance is insufficient. No hypothetical verdict is accepted.
-COLD_CLEARANCE_BINDING = None
+COLD_CLEARANCE_BINDING = {'path': '/private/tmp/review-drain-20260915/drain8174-cold-review-v1.json', 'sha256': '6244aaf7dc3c53318bb7d5df83e452df977b75d3925b36321afc88591c9b40bf', 'same_session_provenance': '/root/review_8174 original reviewer, cold report and narrow adapter confirmation required', 'verdict_pointer': '/verdict', 'verdict_value': 'COLD_SOURCE_CLEAN_FOR_BOUNDED_CAPTURE', 'tree_pointer': '/source_tree', 'tree': '5083bc62b618b49a45d96496b7d431306756cb4f', 'frozen_base': '51cac1ae0ed3f9d0f399a63a716f8cf351fc5938', 'reviewed_main': '3dca18ddd0082dc23bb12c7ca38939b901c28736', 'required_predicates': {'/capture_clearance': True, '/reviewer/session': '/root/review_8174', '/reviewer/same_session': True, '/findings': [], '/checkout_base': '51cac1ae0ed3f9d0f399a63a716f8cf351fc5938', '/reviewed_current_main': '3dca18ddd0082dc23bb12c7ca38939b901c28736', '/predicates/current_main_compatible': True}}
 def confirm_cold(cp,cold,tree):
     b=COLD_CLEARANCE_BINDING
     assert isinstance(b,dict), 'BLOCKED: actual same-session cold report schema/clearance has not yet been bound; root must prepare a new immutable adapter version'
@@ -36,6 +36,17 @@
     assert read_pointer(b['tree_pointer'])==tree==b['tree']
     for p,v in b['required_predicates'].items():assert p.startswith('/') and read_pointer(p)==v
 
+def confirm_reviewed_main(record, expected_base):
+    # Preserve the already reviewed source tree; separately bind unchanged inputs
+    # and the original reviewer's semantic confirmation of the actual new main.
+    b = COLD_CLEARANCE_BINDING
+    assert git('rev-parse', 'HEAD') == expected_base == record['source']['base'] == b['frozen_base']
+    assert git('rev-parse', 'origin/main') == b['reviewed_main'], 'Reviewed current main moved'
+    assert git('merge-base', b['frozen_base'], b['reviewed_main']) == b['frozen_base']
+    changed = set(git('diff', '--name-only', '--no-renames', b['frozen_base'], b['reviewed_main']).splitlines())
+    bound = {e['path'] for e in record['source']['paths'] + sum(record['inputs'].values(), [])}
+    assert not changed & bound, 'Current-main advance overlaps frozen source or input paths'
+
 def main():
     ap=argparse.ArgumentParser()
     for k in ['record','record-sha256','cold','cold-sha256','primary-receipt','primary-receipt-sha256','expected-base','mutation']:ap.add_argument('--'+k,required=True)
@@ -49,7 +60,7 @@
     watch0=primary['whole_tree_watchdog'];assert watch0['samples']>0 and not watch0['violations'] and watch0['limit_seconds']==900 and watch0['limit_bytes']==768*1024*1024
     pr=primary['result']['result'];assert pr['status']=='ok' and pr['exit_code']==0 and re.search(r'^TOTAL: PASS=17 FAIL=0$',pr['stdout'],re.M)
     for e in primary['artifacts']:assert sha(Path(e['path']))==e['sha256'],'Primary evidence changed'
-    assert git('rev-parse','HEAD')==a.expected_base==record['source']['base']==git('rev-parse','origin/main')
+    confirm_reviewed_main(record, a.expected_base)
     assert git('write-tree')==record['source']['tree'] and not git('diff','--name-only'),'Run before primary cache staging; source/index must remain frozen'
     owner=json.loads((R/'author-draft-slot.json').read_text());assert owner['owner']=='PR8174-author' and Path(owner['path']).resolve()==W.resolve()
     planpath=R/'drain8174-author-input-resource-plan-v3.json';assert sha(planpath)=='2290e47f9a26c0af271c45b5990cd4953b83ab5cdc0af0e3226bbe62f03a1547';plan=json.loads(planpath.read_text())
@@ -108,6 +119,7 @@
         body=stdout.read_text();assert f'mutation_family_expected: {family}' in body and f"mutation_family_observed: {''.join(sorted(failed_families))}" in body
         assert re.search(r'^TOTAL: PASS='+str(data['passed'])+' FAIL='+str(data['failed'])+'$',body,re.M)
         after=snapshot();assert after==before and git('write-tree')==record['source']['tree'] and not git('diff','--name-only')
+        confirm_reviewed_main(record, a.expected_base)
         for e in primary['artifacts']:assert sha(Path(e['path']))==e['sha256']
     except BaseException as exc:
         error=dict(error=repr(exc),traceback=traceback.format_exc())
