backlog_evidence/review-drain-20260915/drain8175-mutation-capture-binding-v2.diff
--- drain8175-mutation-capture-v1.py
+++ drain8175-mutation-capture-v2.py
@@ -19,7 +19,7 @@
 # Deliberately unbound: a new immutable adapter version must bind the ACTUAL
 # original-reviewer cold report path/hash, exact verdict pointer/value and tree.
 # Early source clearance is insufficient. No hypothetical verdict is accepted.
-COLD_CLEARANCE_BINDING = None
+COLD_CLEARANCE_BINDING = {'path': '/private/tmp/review-drain-20260915/drain8175-cold-review-v1.json', 'sha256': 'f4c5053ffce5b84d371685ac6a921ebc81e0e62a16bb4dda56c393cb15375052', 'same_session_provenance': '/root/review_8175 original reviewer', 'verdict_pointer': '/clearance', 'verdict_value': 'CLEARED_FOR_BOUNDED_CAPTURE', 'tree_pointer': '/tree', 'tree': '7a01b258c1130dd2cd97dbd2d204395135fc1481', 'required_predicates': {'/reviewer_session': '/root/review_8175', '/same_session_provenance': True, '/base': '3dca18ddd0082dc23bb12c7ca38939b901c28736', '/capture_cleared': True, '/limits/wall_seconds': 60, '/limits/memory_bytes': 402653184}}
 def confirm_cold(cp,cold,tree):
     b=COLD_CLEARANCE_BINDING
     assert isinstance(b,dict), 'BLOCKED: actual same-session cold report schema/clearance has not yet been bound; root must prepare a new immutable adapter version'
