backlog_evidence/review-drain-20260915/drain8176-mutation-capture-dual-binding-v2.diff
--- drain8176-mutation-capture-v1.py
+++ drain8176-mutation-capture-v2.py
@@ -19,7 +19,7 @@
 # Deliberately unbound: a new immutable adapter version must bind the ACTUAL
 # original-reviewer cold report path/hash, exact verdict pointer/value and tree.
 # Early source clearance is insufficient. No hypothetical verdict is accepted.
-COLD_CLEARANCE_BINDING = None
+COLD_CLEARANCE_BINDING = {'path': '/private/tmp/review-drain-20260915/drain8176-cold-review-v1.json', 'sha256': '76112752dfddb90cd9cf6330532d8fe512405da46d713c5a5f7a1b1f99d70778', 'same_session_provenance': '/root/review_8176 original reviewer; narrow adapter confirmation required', 'verdict_pointer': '/verdict', 'verdict_value': 'COLD SOURCE AND BOUNDED PLAN CLEARED; ADAPTER BINDING CONFIRMATION REQUIRED', 'tree_pointer': '/tree', 'tree': '7f5b50cdc4c3b1e475cbaadc3bf861a7052b298d', 'frozen_base': 'e46c78efd91d00c8a96ea4f11ea8bc5a8e3ed0e6', 'reviewed_main': '1bb8b7befb857852acaed93bcf2bb1e47925b013', 'required_predicates': {'/session': '/root/review_8176', '/base': 'e46c78efd91d00c8a96ea4f11ea8bc5a8e3ed0e6', '/reviewed_current_main': '1bb8b7befb857852acaed93bcf2bb1e47925b013', '/findings': [], '/clearance/same_session_original_and_affected_review': True, '/clearance/current_main_delta_disjoint_from_bound_closure': True, '/clearance/resource_plan_accepted': True, '/execution_contract/wall_seconds_each': 60, '/execution_contract/sampled_process_tree_rss_bytes': 402653184}}
 def confirm_cold(cp,cold,tree):
     b=COLD_CLEARANCE_BINDING
     assert isinstance(b,dict), 'BLOCKED: actual same-session cold report schema/clearance has not yet been bound; root must prepare a new immutable adapter version'
@@ -36,6 +36,17 @@
     assert read_pointer(b['tree_pointer'])==tree==b['tree']
     for p,v in b['required_predicates'].items():assert p.startswith('/') and read_pointer(p)==v
 
+def confirm_reviewed_main(record, expected_base):
+    # Preserve the already reviewed source tree; separately bind unchanged inputs
+    # and the original reviewer's semantic confirmation of the actual new main.
+    b = COLD_CLEARANCE_BINDING
+    assert git('rev-parse', 'HEAD') == expected_base == record['source']['base'] == b['frozen_base']
+    assert git('rev-parse', 'origin/main') == b['reviewed_main'], 'Reviewed current main moved'
+    assert git('merge-base', b['frozen_base'], b['reviewed_main']) == b['frozen_base']
+    changed = set(git('diff', '--name-only', '--no-renames', b['frozen_base'], b['reviewed_main']).splitlines())
+    bound = {e['path'] for e in record['source']['paths'] + sum(record['inputs'].values(), [])}
+    assert not changed & bound, 'Current-main advance overlaps frozen source or input paths'
+
 def main():
     ap=argparse.ArgumentParser()
     for k in ['record','record-sha256','cold','cold-sha256','primary-receipt','primary-receipt-sha256','expected-base','mutation']:ap.add_argument('--'+k,required=True)
@@ -51,7 +62,8 @@
     watch0=primary['whole_tree_watchdog'];assert watch0['samples']>0 and not watch0['violations'] and watch0['limit_seconds']==60 and watch0['limit_bytes']==384*1024*1024
     pr=primary['result']['result'];assert pr['status']=='ok' and pr['exit_code']==0 and re.search(r'^TOTAL: PASS=22 FAIL=0$',pr['stdout'],re.M)
     for e in primary['artifacts']:assert sha(Path(e['path']))==e['sha256'],'Primary evidence changed'
-    assert git('rev-parse','HEAD')==a.expected_base==record['source']['base']==git('rev-parse','origin/main')
+    confirm_reviewed_main(record, a.expected_base)
+    assert True
     assert git('write-tree')==record['source']['tree'] and not git('diff','--name-only'),'Run before primary cache staging; source/index must remain frozen'
     owner=json.loads((R/'review-draft-slot.json').read_text());assert owner['owner']=='PR8176-author' and Path(owner['path']).resolve()==W.resolve()
     planpath=R/'drain8176-capture-plan-v1.json';assert sha(planpath)==PLAN_SHA256;plan=json.loads(planpath.read_text())
@@ -111,6 +123,7 @@
         assert len(re.findall(r'^PASS: [A-Z][0-9]+ ',body,re.M))==21
         data=dict(parsed_stdout=True,failed_tags=failures,expected_failed_tags=expected,completed_checks=22,passed=21,failed=1)
         after=snapshot();assert after==before and git('write-tree')==record['source']['tree'] and not git('diff','--name-only')
+        confirm_reviewed_main(record, a.expected_base)
         for e in primary['artifacts']:assert sha(Path(e['path']))==e['sha256']
     except BaseException as exc:
         error=dict(error=repr(exc),traceback=traceback.format_exc())
